tutorials/RAS/MUSTE/MUSTE_CW/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler implicit;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
// UEqn
    div(phi,U)     Gauss upwind phi;
// CEqn
    div(phi,C)    Gauss vanLeer; //Gamma 1;
    div(phir,C)    Gauss linear; //Gamma 1;
// pEqn
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
// k and EpsilonEqn
    div(phi,k)     Gauss limitedLinear 1;
    div(phi,epsilon) Gauss limitedLinear 1;
    div(phi,omega) Gauss limitedLinear 1;

}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}


interpolationSchemes
{
    default  linear;
//    flux((U+Ws)) downwind phip;
//    flux(Ws) downwind phip;
    /*interpolate((U+Ws)) upwind phi;//downwind phip;
    flux(U) linear;
    flux((U+Ws)) upwind phi;
    flux(HbyA) linear;
    dotInterpolate(S,U_0) linear;
    interpolate((1|A(U))) linear;*/
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p                 ;
    C                 ;
}
wallDist
{
method meshWave;
}


// ************************************************************************* //
